#+TITLE: Pipes Visualization
#+SUBTITLE: Advent of Code 2023, Day 10
#+OPTIONS: ':t ^:nil num:nil
#+PROPERTY: header-args :eval never-export

** Examples

The final example in the puzzle description looks like:

#+begin_src clojure :results silent
  (def example-string
  "7-F7-
  .FJ|7
  SJLL7
  |F--J
  LJ.LJ")
#+end_src

The starting position is at x=0, y=2:

#+begin_src clojure :exports both
  (get-grid-at (parse-grid example-string) 0 2)
#+end_src

#+RESULTS:
: \S

* Drawing the Map

Drawing the map is conceptually simple,
but I had to tinker a bit with the [[https://docs.oracle.com/en/java/javase/21/docs/api/java.desktop/java/awt/image/BufferedImage.html][BufferedImage]] constructor
to get the transparency in the tiles working correctly.
I found that the easiest thing to do
was to copy the settings from the tileset image.

By poking around in the REPL,
I worked out that the source tileset
is [[https://docs.oracle.com/en/java/javase/21/docs/api/java.desktop/java/awt/image/BufferedImage.html#TYPE_BYTE_INDEXED][TYPE_BYTE_INDEXED]] with an [[https://docs.oracle.com/en/java/javase/21/docs/api/java.desktop/java/awt/image/IndexColorModel.html][IndexColorModel]].

#+begin_src clojure :exports both
  (let [tileset-image (read-image "../assets/water.png")]
    (= BufferedImage/TYPE_BYTE_INDEXED (.getType tileset-image)))
#+end_src

#+RESULTS:
: true

#+begin_src clojure :exports both
  (let [tileset-image (read-image "../assets/water.png")]
    (.getColorModel tileset-image))
#+end_src

#+RESULTS:
: #object[java.awt.image.IndexColorModel 0x3b4f4fcd "IndexColorModel: #pixelBits = 8 numComponents = 4 color space = java.awt.color.ICC_ColorSpace@150e0811 transparency = 2 transIndex   = 0 has alpha = true isAlphaPre = false"]

I won't claim to understand exactly what these mean,
so if you use this code with a different tileset
you may have to make some changes.

To create a matching BufferedImage for the output,
I had to add some coercions ([[https://clojuredocs.org/clojure.core/int][int]])
and type hints to eliminate reflection warnings:

#+begin_src clojure :eval no
  (BufferedImage.
   (int (* (grid-width grid) tile-width scale))
   (int (* (grid-height grid) tile-height scale))
   (.getType tileset-image)
   ^IndexColorModel (.getColorModel tileset-image))
#+end_src

With transparency working,
I can use one of the tiles as a background
and draw the pipes on top of it.
This will draw the background twice
on "empty" grid spaces, but it doesn't matter.

#+name: draw-tiles
#+begin_src clojure :results silent
  (defn draw-tiles
    "Returns a new BufferedImage generated from the tileset
    and the parsed input grid.

    Optional keyword argument :scale is an integer multiplier
    applied to the size of the tiles, default 1."
    [^BufferedImage tileset-image
     grid
     & {:keys [scale] :or {scale 1}}]
    (let [tile-map (make-tile-map tileset-image)
          buffer (BufferedImage.
                  (int (* (grid-width grid) tile-width scale))
                  (int (* (grid-height grid) tile-height scale))
                  (.getType tileset-image)
                  ^IndexColorModel (.getColorModel tileset-image))
          graphics (.createGraphics buffer)]
      (doseq [x (range (grid-width grid))
              y (range (grid-height grid))]
        ;; Draw background
        (.drawImage graphics
                    (get tile-map \.)
                    (* x tile-width scale)
                    (* y tile-height scale)
                    (* tile-width scale)
                    (* tile-height scale)
                    nil)
        ;; Draw pipe
        (let [character (get-grid-at grid x y)
              tile (get tile-map character)]
          (.drawImage graphics
                      tile
                      (* x tile-width scale)
                      (* y tile-height scale)
                      (* tile-width scale)
                      (* tile-height scale)
                      nil)))
      buffer))
#+end_src

